mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/pwm.c
    uint16_t comp_val = 0;
    comp_val = val * self->load / 100;
    
    // reenable output if duty was 0%
    if (val && self->duty == 0)
        PWMOutputState(pwm_mod_reg_map[self->mod_id], 1 << (self->id % PWM_M1PWM0), 1);
    
    // set pulse width
    if (val)
        PWMPulseWidthSet(pwm_mod_reg_map[self->mod_id], pwm_out_reg_map[self->id % PWM_M1PWM0], comp_val);
    // silently disable output as left aligned PWM does not allow for 0% duty cycle
    else
        PWMOutputState(pwm_mod_reg_map[self->mod_id], 1 << (self->id % PWM_M1PWM0), 0);
    
    self->duty = val;
}

//*****************************************************************************
//
//! Syncs the timing of the provided PWM objects
//!
//! \param self is a pointer to the PWM object
//! \param tbs is a pointer to array of the PWM object which are to be synced
//! \param n_tbs is the number of PWM objects which are to be synced
//!
//! \return None
//
//*****************************************************************************
void pwm_update_sync(machine_pwm_obj_t* self, const machine_pwm_obj_t* tbs, uint8_t n_tbs)
{
    uint8_t tbs_flag = (1 << self->gen_id) << (4 * self->mod_id);
    for (uint8_t i = 0; i < n_tbs; i++)
        tbs_flag |= (1 << tbs[i].gen_id) << (4 * tbs[i].mod_id);
    if (tbs_flag & 0x0f)
        PWMSyncTimeBase(pwm_mod_reg_map[0], tbs_flag & 0x0f);
    if (tbs_flag & 0xf0)
        PWMSyncTimeBase(pwm_mod_reg_map[1], (tbs_flag >> 4) & 0x0f);
}

//*****************************************************************************
//
//! Sets the deadband delays of PWM object
//!
//! \param self is a pointer to the PWM object
//! \param val is the desired value
//!
//! \note Deadband delays are shared within generators, i.e. 
//! \b PWM_M0PWM0 and \b PWM_M0PWM1 share the same deadband delay, as do 
//! \b PWM_M0PWM2 and \b PWM_M0PWM3, etc.
//!
//! \return None
//
//*****************************************************************************
void pwm_update_db(machine_pwm_obj_t* self, uint16_t db_falling, uint16_t db_rising)
{
    PWMDeadBandEnable(pwm_mod_reg_map[self->mod_id], pwm_gen_reg_map[self->gen_id], db_rising, db_falling);
    self->db_falling = db_falling;
    self->db_rising = db_rising;
    // update values for twin
    machine_pwm_obj[self->twin_id].db_falling = db_falling;
    machine_pwm_obj[self->twin_id].db_rising = db_rising;
}

//*****************************************************************************
//
// Pointers to interrupt handler routines
//
//*****************************************************************************
static const void* irq_handlers[2][4] = {{&PWM0GEN0_Handler, &PWM0GEN1_Handler, &PWM0GEN2_Handler, &PWM0GEN3_Handler},
                                        {&PWM1GEN0_Handler, &PWM1GEN1_Handler, &PWM1GEN2_Handler, &PWM1GEN3_Handler}};

//*****************************************************************************
//
//! Generic interrupt handler which identifies interrupt source and calls 
//! corresponding user defined interrupt handler
//!
//! \param mod_id is the index of the PWM module
//! \param gen_id is the index of the PWM generator
//!
//! \note Interrupts are shared within generators. PWM objects are distinguished
//! by A and B interrupts, corresponding to even and odd PWM object indexes
//!
//! \return None
//
//*****************************************************************************
void pwm_irq_handler(uint8_t mod_id, uint8_t gen_id)
{
    uint32_t gen_int = PWMGenIntStatus(pwm_mod_reg_map[mod_id], pwm_gen_reg_map[mod_id], 1);
    machine_pwm_obj_t* pwm = &machine_pwm_obj[mod_id * PWM_M1PWM0 + gen_id * 2];
    // call irq
    if (pwm->irq != mp_const_none)
        mp_call_function_1(pwm->irq, mp_obj_new_int(gen_int));
    // call irq of twin in generator
    if (machine_pwm_obj[pwm->twin_id].irq != mp_const_none)
        mp_call_function_1(machine_pwm_obj[pwm->twin_id].irq, mp_obj_new_int(gen_int));
    // clear interrupts
    PWMGenIntClear(pwm_mod_reg_map[mod_id], pwm_gen_reg_map[gen_id], gen_int);
}

//*****************************************************************************
//
//! Sets the interrupt handler for PWM object
//!
//! \param self is a pointer to the PWM object
//! \param irq is the interrupt handler to attach. This function receives the 
//! status of the interrupt register via its first argument of type \b int
//! \param irq_mode specifies interrupts and triggers to act upon.
//! The \e irq_mode logical OR of the following:
//! \b PWM_INT_CNT_ZERO, \b PWM_INT_CNT_LOAD, \b PWM_INT_CNT_AU, \b PWM_INT_CNT_AD,
//! \b PWM_INT_CNT_BU, \b PWM_INT_CNT_BD, \b PWM_TR_CNT_ZERO, \b PWM_TR_CNT_LOAD,
//! \b PWM_TR_CNT_AU, \b PWM_TR_CNT_AD, \b PWM_TR_CNT_BU, or \b PWM_TR_CNT_BD
//!
//! \return None
//
//*****************************************************************************
void pwm_update_irq(machine_pwm_obj_t* self, mp_obj_t irq, uint16_t irq_mode)
{
    // disable irq
    if (irq == mp_const_none)
    {
        PWMGenIntUnregister(pwm_mod_reg_map[self->mod_id], pwm_gen_reg_map[self->gen_id]);
        // dont disable interrupts if twin is using them
        machine_pwm_obj_t* twin = &machine_pwm_obj[self->twin_id];
        if (twin->irq == mp_const_none)
        {
            PWMIntDisable(pwm_mod_reg_map[self->mod_id], 1 << self->gen_id);
            PWMGenIntTrigDisable(pwm_mod_reg_map[self->mod_id], pwm_gen_reg_map[self->gen_id], irq_mode);
        }
    }
    // setup irq
    else if (mp_obj_is_fun(irq))
    {
        PWMIntEnable(pwm_mod_reg_map[self->mod_id], 1 << self->gen_id);
        PWMGenIntRegister(pwm_mod_reg_map[self->mod_id], pwm_gen_reg_map[self->gen_id], irq_handlers[self->mod_id][self->gen_id]);
        PWMGenIntTrigEnable(pwm_mod_reg_map[self->mod_id], pwm_gen_reg_map[self->gen_id], irq_mode);
    }
    else
        mp_raise_ValueError(MP_ERROR_TEXT("irq must be a function handler(flag: int) or None"));
    
    self->irq = irq;
    self->irq_mode = irq_mode;
}

//*****************************************************************************
//
//! Initializes the output pin of PWM object
//!
//! \param self is a pointer to the PWM object
//! \param val specifies whether to init or deinit the pin
//!
//! \return None
//
//*****************************************************************************
void pwm_set_gpio(machine_pwm_obj_t* self, bool val)
{
    // alternate pin
    if (pwm_get_id_from_pin(self->pin, 1) == self->id)
        self->alternate_pin = 1;
    // standard pin not found
    else if (pwm_get_id_from_pin(self->pin, 0) != self->id)
        mp_raise_ValueError(MP_ERROR_TEXT("Can't setup pin for PWM"));

    SysCtlPeripheralEnable(self->pin->periph);
    while (!SysCtlPeripheralReady(self->pin->periph));
    GPIOPinConfigure(gpio_af_val_map[self->id][self->alternate_pin]);
    GPIOPinTypePWM(self->pin->gpio, 1 << get_pin_index_from_pin(self->pin));
}

//*****************************************************************************
//
//! Initializes the PWM object
//!
//! \param self is a pointer to the PWM object
//! \param pin is the output pin object
//! \param active specifies the state of the output pin
//! \param invert inverts the state of the output pin
//! \param freq specifies the frequency of the PWM signal
//! \param duty specifies the duty cycle percentage of the PWM signal
//! \param db_falling specifies the deadband delay in clock ticks on a falling edge
//! \param db_rising specifies the deadband delay in clock ticks on a rising edge
//! \param mode specifies the mode of the PWM object. It is the logical OR of the 
//! following:
//! - \b PWM_GEN_MODE_DOWN or \b PWM_GEN_MODE_UP_DOWN to specify the counting
//!   mode
//! - \b PWM_GEN_MODE_SYNC or \b PWM_GEN_MODE_NO_SYNC to specify the counter
//!   load and comparator update synchronization mode
//! - \b PWM_GEN_MODE_DBG_RUN or \b PWM_GEN_MODE_DBG_STOP to specify the debug
//!   behavior
//! - \b PWM_GEN_MODE_GEN_NO_SYNC, \b PWM_GEN_MODE_GEN_SYNC_LOCAL, or
//!   \b PWM_GEN_MODE_GEN_SYNC_GLOBAL to specify the update synchronization
//!   mode for generator counting mode changes
//! - \b PWM_GEN_MODE_DB_NO_SYNC, \b PWM_GEN_MODE_DB_SYNC_LOCAL, or
//!   \b PWM_GEN_MODE_DB_SYNC_GLOBAL to specify the deadband parameter
//!   synchronization mode
//! \param irq is the interrupt handler to attach. This function receives the 
//! status of the interrupt register via its first argument of type \b int
//! \param irq_mode specifies interrupts and triggers to act upon.
//! The \e irq_mode logical OR of the following:
//! \b PWM_INT_CNT_ZERO, \b PWM_INT_CNT_LOAD, \b PWM_INT_CNT_AU, \b PWM_INT_CNT_AD,
//! \b PWM_INT_CNT_BU, \b PWM_INT_CNT_BD, \b PWM_TR_CNT_ZERO, \b PWM_TR_CNT_LOAD,
//! \b PWM_TR_CNT_AU, \b PWM_TR_CNT_AD, \b PWM_TR_CNT_BU, or \b PWM_TR_CNT_BD
//!
//! \return None
//
//*****************************************************************************
void pwm_init(machine_pwm_obj_t* self, const pin_obj_t* pin, bool active, bool invert, uint32_t freq, uint8_t duty, uint16_t db_falling, uint16_t db_rising, uint32_t mode, mp_obj_t irq, uint16_t irq_mode)
{
    SysCtlPeripheralEnable(pwm_periph_reg_map[self->mod_id]);
    while (!SysCtlPeripheralReady(pwm_periph_reg_map[self->mod_id]));

    machine_pwm_obj_t* twin = &machine_pwm_obj[self->twin_id];
    // if twin pwm is active dont allow different mode
    if (twin->freq && mode != twin->mode)
        mp_raise_ValueError(MP_ERROR_TEXT("Mode must be the same inside one PWM generator"));
    // configure pwm generator
    PWMGenConfigure(pwm_mod_reg_map[self->mod_id], pwm_gen_reg_map[self->gen_id], mode);
    // setup output pin
    if (pin)
    {
        self->pin = pin;
        pwm_set_gpio(self, 1);
    }

    pwm_update_freq(self, freq);
    pwm_update_duty(self, duty);
    pwm_update_invert(self, invert);
    pwm_update_db(self, db_falling, db_rising);
    pwm_update_irq(self, irq, irq_mode);
    PWMGenEnable(pwm_mod_reg_map[self->mod_id], pwm_gen_reg_map[self->gen_id]);
    pwm_update_active(self, active);
}

//*****************************************************************************
//
//! Deinitializes the PWM object
//!
//! \param self is a pointer to the PWM object
//!
//! \return None
//
//*****************************************************************************
void pwm_deinit(machine_pwm_obj_t* self)
{
    pwm_update_irq(self, mp_const_none, self->irq_mode);
    pwm_update_active(self, 0);
    // if twin pwm is active dont disable generator
    if (!machine_pwm_obj[self->twin_id].in_use)
        PWMGenDisable(pwm_mod_reg_map[self->mod_id], pwm_gen_reg_map[self->gen_id]);
    if (self->pin)
        pwm_set_gpio(self, 0);
    machine_pwm_obj_val_init(self);
}

//*****************************************************************************
//
//! Initializes the PWM object (helper)
//!
//! \param self is a pointer to the PWM object
//! \param pin is the output pin object
//! \param active specifies the state of the output pin
//! \param invert inverts the state of the output pin
//! \param freq specifies the frequency of the PWM signal
//! \param duty specifies the duty cycle percentage of the PWM signal
//! \param db_falling specifies the deadband delay in clock ticks on a falling edge
//! \param db_rising specifies the deadband delay in clock ticks on a rising edge
//! \param mode specifies the mode of the PWM object. It is the logical OR of the 
//! following:
//! - \b PWM_GEN_MODE_DOWN or \b PWM_GEN_MODE_UP_DOWN to specify the counting
//!   mode
//! - \b PWM_GEN_MODE_SYNC or \b PWM_GEN_MODE_NO_SYNC to specify the counter
//!   load and comparator update synchronization mode
//! - \b PWM_GEN_MODE_DBG_RUN or \b PWM_GEN_MODE_DBG_STOP to specify the debug
//!   behavior
//! - \b PWM_GEN_MODE_GEN_NO_SYNC, \b PWM_GEN_MODE_GEN_SYNC_LOCAL, or
//!   \b PWM_GEN_MODE_GEN_SYNC_GLOBAL to specify the update synchronization
//!   mode for generator counting mode changes
//! - \b PWM_GEN_MODE_DB_NO_SYNC, \b PWM_GEN_MODE_DB_SYNC_LOCAL, or
//!   \b PWM_GEN_MODE_DB_SYNC_GLOBAL to specify the deadband parameter
//!   synchronization mode
//! \param irq is the interrupt handler to attach. This function receives the 
//! status of the interrupt register via its first argument of type \b int
//! \param irq_mode specifies interrupts and triggers to act upon.
//! The \e irq_mode logical OR of the following:
//! \b PWM_INT_CNT_ZERO, \b PWM_INT_CNT_LOAD, \b PWM_INT_CNT_AU, \b PWM_INT_CNT_AD,
//! \b PWM_INT_CNT_BU, \b PWM_INT_CNT_BD, \b PWM_TR_CNT_ZERO, \b PWM_TR_CNT_LOAD,
//! \b PWM_TR_CNT_AU, \b PWM_TR_CNT_AD, \b PWM_TR_CNT_BU, or \b PWM_TR_CNT_BD
//!
//! \return PWM object
//
//*****************************************************************************
mp_obj_t machine_pwm_init_helper(machine_pwm_obj_t* self, size_t n_args, const mp_obj_t* pos_args, mp_map_t* kw_args, const pin_obj_t* pin)
{
    enum {ARG_pin, ARG_active, ARG_invert, ARG_freq, ARG_duty, ARG_db_falling, ARG_db_rising, ARG_mode, ARG_irq, ARG_irq_mode};
    static const mp_arg_t allowed_args[] = 
    {
        {MP_QSTR_pin,           MP_ARG_KW_ONLY | MP_ARG_OBJ,    {.u_obj = mp_const_none}},
        {MP_QSTR_active,        MP_ARG_KW_ONLY | MP_ARG_BOOL,   {.u_int = true}},
        {MP_QSTR_invert,        MP_ARG_KW_ONLY | MP_ARG_BOOL,   {.u_int = false}},
        {MP_QSTR_freq,          MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = 0}},
        {MP_QSTR_duty,          MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = 0}},
        {MP_QSTR_db_falling,    MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = 0}},
        {MP_QSTR_db_rising,     MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = 0}},
        {MP_QSTR_mode,          MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = PWM_GEN_MODE_DOWN}},
        {MP_QSTR_irq,           MP_ARG_KW_ONLY | MP_ARG_OBJ,    {.u_obj = mp_const_none}},
        {MP_QSTR_irq_mode,      MP_ARG_KW_ONLY | MP_ARG_OBJ,    {.u_int = 0}},
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // get arguments
    if (!pin)               // dont overwrite if created via pin
        pin =               (args[ARG_pin].u_obj == mp_const_none ? NULL: pin_find(args[ARG_pin].u_obj));

