mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/pwm.c
    bool active =           args[ARG_active].u_int;
    bool invert =           args[ARG_invert].u_int;
    uint32_t freq =         args[ARG_freq].u_int;
    uint8_t duty =          args[ARG_duty].u_int;
    uint16_t db_falling =   args[ARG_db_falling].u_int;
    uint16_t db_rising =    args[ARG_db_rising].u_int;
    uint32_t mode =         args[ARG_mode].u_int;
    mp_obj_t irq =          args[ARG_irq].u_obj;
    uint16_t irq_mode =     args[ARG_irq_mode].u_int;

    pwm_init(self, pin, active, invert, freq, duty, db_falling, db_rising, mode, irq, irq_mode);
    
    return self;
}

//*****************************************************************************
//
//! Deinitializes the PWM object (helper)
//!
//! \param self is a pointer to the PWM object
//!
//! \return None
//
//*****************************************************************************
mp_obj_t machine_pwm_deinit_helper(machine_pwm_obj_t* self)
{
    pwm_deinit(self);
    self = (mp_obj_t) mp_const_none;
    return self;
}

//*****************************************************************************
//
//! Sets/gets the output of PWM object (helper)
//!
//! \param self is a pointer to the PWM object
//! \param val is the desired output state
//!
//! \return Output state
//
//*****************************************************************************
mp_obj_t machine_pwm_active_helper(machine_pwm_obj_t* self, size_t n_args, const mp_obj_t* pos_args)
{
    if (n_args)
    {
        if (mp_obj_is_bool(pos_args[0]) || mp_obj_is_int(pos_args[0]))
            pwm_update_active(self, MP_OBJ_SMALL_INT_VALUE(pos_args[0]));
        else
            mp_raise_ValueError(MP_ERROR_TEXT("Type mismatch: not an int"));
    }
    return mp_obj_new_bool(self->active);
}

//*****************************************************************************
//
//! Sets/gets inversion of the output of PWM object (helper)
//!
//! \param self is a pointer to the PWM object
//! \param val is the desired output inversion state
//!
//! \return Inversion state
//
//*****************************************************************************
mp_obj_t machine_pwm_invert_helper(machine_pwm_obj_t* self, size_t n_args, const mp_obj_t* pos_args)
{
    if (n_args)
    {
        if (mp_obj_is_bool(pos_args[0]) || mp_obj_is_int(pos_args[0]))
            pwm_update_invert(self, MP_OBJ_SMALL_INT_VALUE(pos_args[0]));
        else
            mp_raise_ValueError(MP_ERROR_TEXT("Type mismatch: not an int"));
    }
    return mp_obj_new_bool(self->invert);
}

//*****************************************************************************
//
//! Sets/gets global clock divider (helper)
//!
//! \param self is a pointer to the PWM object
//! \param val is one of \b CLK_DIV_1, \b CLK_DIV_2, \b CLK_DIV_4,
//! \b CLK_DIV_8, \b CLK_DIV_16, \b CLK_DIV_32, \b CLK_DIV_64
//!
//! \return Clock divider, one of \b CLK_DIV_1, \b CLK_DIV_2, \b CLK_DIV_4,
//! \b CLK_DIV_8, \b CLK_DIV_16, \b CLK_DIV_32, \b CLK_DIV_64
//
//*****************************************************************************
mp_obj_t machine_pwm_clock_divider_helper(machine_pwm_obj_t* self, size_t n_args, const mp_obj_t* pos_args)
{
    if (n_args)
    {
        if (mp_obj_is_int(pos_args[0]))
            pwm_update_clock_divider(self, MP_OBJ_SMALL_INT_VALUE(pos_args[0]));
        else
            mp_raise_ValueError(MP_ERROR_TEXT("Type mismatch: not an int"));
    }
    return mp_obj_new_int(pwm_clk_div_val);
}

//*****************************************************************************
//
//! Sets/gets the frequency of PWM object (helper)
//!
//! \param self is a pointer to the PWM object
//! \param val is the desired frequency
//!
//! \return Frequency
//
//*****************************************************************************
mp_obj_t machine_pwm_freq_helper(machine_pwm_obj_t* self, size_t n_args, const mp_obj_t* pos_args)
{
    if (n_args)
    {
        if (mp_obj_is_int(pos_args[0]))
            pwm_update_freq(self, (uint32_t) MP_OBJ_SMALL_INT_VALUE(pos_args[0]));
        else
            mp_raise_ValueError(MP_ERROR_TEXT("Type mismatch: not an int"));
    }
    return mp_obj_new_int(self->freq);
}

//*****************************************************************************
//
//! Sets/gets the duty cycle of PWM object (helper)
//!
//! \param self is a pointer to the PWM object
//! \param val is the desired duty cycle percentage
//!
//! \return Duty cycle (percentage)
//
//*****************************************************************************
mp_obj_t machine_pwm_duty_helper(machine_pwm_obj_t* self, size_t n_args, const mp_obj_t* pos_args)
{
    if (n_args)
    {
        if (mp_obj_is_int(pos_args[0]))
            pwm_update_duty(self, MP_OBJ_SMALL_INT_VALUE(pos_args[0]));
        else
            mp_raise_ValueError(MP_ERROR_TEXT("Type mismatch: not an int"));
    }
    return mp_obj_new_int(self->duty);
}

//*****************************************************************************
//
//! Syncs the timing of the provided PWM objects (helper)
//!
//! \param self is a pointer to the PWM object
//! \param tbs is a pointer to array of the PWM object which are to be synced
//! \param n_tbs is the number of PWM objects which are to be synced
//!
//! \return None
//
//*****************************************************************************
mp_obj_t machine_pwm_sync_helper(machine_pwm_obj_t* self, size_t n_args, const mp_obj_t* pos_args)
{
    if (n_args)
    {
        for (uint8_t i = 0; i < n_args; i++)
        {
            if (!mp_obj_is_type(pos_args[i], &machine_pwm_type))
                mp_raise_ValueError(MP_ERROR_TEXT("Type mismatch: not a PWM object"));
        }
    }
    pwm_update_sync(self, (machine_pwm_obj_t*) pos_args, n_args);
    return mp_const_none;
}

//*****************************************************************************
//
//! Sets/gets the deadband delays of PWM object
//!
//! \param self is a pointer to the PWM object
//! \param db_falling specifies the deadband delay in clock ticks on a falling edge
//! \param db_rising specifies the deadband delay in clock ticks on a rising edge

