mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/pwm.c
//!
//! \note Deadband delays are shared within generators, i.e. 
//! \b PWM_M0PWM0 and \b PWM_M0PWM1 share the same deadband delay, as do 
//! \b PWM_M0PWM2 and \b PWM_M0PWM3, etc.
//!
//! \return Tuple(db_falling, db_rising)
//
//*****************************************************************************
mp_obj_t machine_pwm_db_helper(machine_pwm_obj_t* self, size_t n_args, const mp_obj_t* pos_args, mp_map_t* kw_args)
{
    enum {ARG_db_falling, ARG_db_rising};
    static const mp_arg_t allowed_args[] = 
    {
        {MP_QSTR_db_falling,    MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = -1}},
        {MP_QSTR_db_rising,     MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = -1}},
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    if (args[ARG_db_falling].u_int != -1 && args[ARG_db_rising].u_int != -1)
    {
        uint16_t db_falling = (args[ARG_db_falling].u_int == -1 ? 0 : args[ARG_db_falling].u_int);
        uint16_t db_rising = (args[ARG_db_rising].u_int == -1 ? 0 : args[ARG_db_rising].u_int);
        pwm_update_db(self, db_falling, db_rising);
    }
    mp_obj_t ret[] = {mp_obj_new_int(self->db_falling), mp_obj_new_int(self->db_rising)};
    return mp_obj_new_tuple(2, ret);
}

//*****************************************************************************
//
//! Sets/gets the interrupt handler for PWM object
//!
//! \param self is a pointer to the PWM object
//! \param irq is the interrupt handler to attach. This function receives the 
//! status of the interrupt register via its first argument of type \b int
//! \param irq_mode specifies interrupts and triggers to act upon.
//! The \e irq_mode logical OR of the following:
//! \b PWM_INT_CNT_ZERO, \b PWM_INT_CNT_LOAD, \b PWM_INT_CNT_AU, \b PWM_INT_CNT_AD,
//! \b PWM_INT_CNT_BU, \b PWM_INT_CNT_BD, \b PWM_TR_CNT_ZERO, \b PWM_TR_CNT_LOAD,
//! \b PWM_TR_CNT_AU, \b PWM_TR_CNT_AD, \b PWM_TR_CNT_BU, or \b PWM_TR_CNT_BD
//!
//! \return Tuple(irq, irq_mode)
//
//*****************************************************************************
mp_obj_t machine_pwm_irq_helper(machine_pwm_obj_t* self, size_t n_args, const mp_obj_t* pos_args)
{
    if (n_args)
    {
        uint16_t mode = self->irq_mode;
        if (n_args > 1)
        {
            if (mp_obj_is_int(pos_args[1]))
                mode = MP_OBJ_SMALL_INT_VALUE(pos_args[1]);
            else
                mp_raise_ValueError(MP_ERROR_TEXT("Type mismatch: mode is not an int"));
        }
        pwm_update_irq(self, pos_args[0], mode);
    }
    mp_obj_t ret[] = {  self->irq, 
                        mp_obj_new_int(self->irq_mode)};
    return mp_obj_new_tuple(2, ret);
}

//*****************************************************************************
//
//! \method PWM(arg0, [pin, active, invert, freq, duty, db_falling, db_rising, mode, irq, irq_mode])
//! Constructor of PWM object
//!
//! \param arg0 is one of the following:
//! - \b PWM_M0PWM0, \b PWM_M0PWM1, \b PWM_M0PWM2, \b PWM_M0PWM3, 
//! \b PWM_M0PWM4, \b PWM_M0PWM5, \b PWM_M0PWM6, \b PWM_M0PWM7, 
//! \b PWM_M1PWM0, \b PWM_M1PWM1, \b PWM_M1PWM2, \b PWM_M1PWM3, 
//! \b PWM_M1PWM4, \b PWM_M1PWM5, \b PWM_M1PWM6, or \b PWM_M1PWM7
//! - a pin object
//! - the name string of a pin
//! \param pin specifies the output pin
//! \param active specifies the state of the output pin
//! \param invert inverts the state of the output pin
//! \param freq specifies the frequency of the PWM signal
//! \param duty specifies the duty cycle percentage of the PWM signal
//! \param db_falling specifies the deadband delay in clock ticks on a falling edge
//! \param db_rising specifies the deadband delay in clock ticks on a rising edge
//! \param mode specifies the mode of the PWM object. It is the logical OR of the 
//! following:
//! - \b MODE_DOWN or \b MODE_UP_DOWN to specify the counting
//!   mode
//! - \b MODE_SYNC or \b MODE_NO_SYNC to specify the counter
//!   load and comparator update synchronization mode
//! - \b MODE_DBG_RUN or \b MODE_DBG_STOP to specify the debug
//!   behavior
//! - \b MODE_GEN_NO_SYNC, \b MODE_GEN_SYNC_LOCAL, or
//!   \b MODE_GEN_SYNC_GLOBAL to specify the update synchronization
//!   mode for generator counting mode changes
//! - \b MODE_DB_NO_SYNC, \b MODE_DB_SYNC_LOCAL, or
//!   \b MODE_DB_SYNC_GLOBAL to specify the deadband parameter
//!   synchronization mode
//! \param irq is the interrupt handler to attach. This function receives the 
//! status of the interrupt register via its first argument of type \b int
//! \param irq_mode specifies interrupts and triggers to act upon.
//! The \e irq_mode logical OR of the following:
//! \b IRQ_INT_CNT_ZERO, \b IRQ_INT_CNT_LOAD, \b IRQ_INT_CNT_AU, \b IRQ_INT_CNT_AD,
//! \b IRQ_INT_CNT_BU, \b IRQ_INT_CNT_BD, \b IRQ_TR_CNT_ZERO, \b IRQ_TR_CNT_LOAD,
//! \b IRQ_TR_CNT_AU, \b IRQ_TR_CNT_AD, \b IRQ_TR_CNT_BU, or \b IRQ_TR_CNT_BD
//!
//! \return PWM object
//
//*****************************************************************************
static mp_obj_t mp_machine_pwm_make_new(const mp_obj_type_t* type, size_t n_args, size_t n_kw, const mp_obj_t* args)
{
    uint8_t pwm_id = 0xff;
    const pin_obj_t* pin = NULL;

    // init via pin name
    if (mp_obj_is_str(args[0]))
    {
        pin = pin_find(args[0]);
        pwm_id = pwm_get_id_from_pin(pin, 0);
        if (pwm_id == 0xff)
            mp_raise_ValueError(MP_ERROR_TEXT("Pin incapable of PWM function"));
    }
    // init via pin obj
    else if (mp_obj_is_type(args[0], &pin_type))
    {
        pin = pin_find(args[0]);
        pwm_id = pwm_get_id_from_pin(pin, 0);
        if (pwm_id == 0xff)
            mp_raise_ValueError(MP_ERROR_TEXT("Pin incapable of PWM function"));
    }
    // init via PWM module id
    else if (mp_obj_is_int(args[0]) && MP_OBJ_SMALL_INT_VALUE(args[0]) >= PWM_M0PWM0 && MP_OBJ_SMALL_INT_VALUE(args[0]) <= PWM_M1PWM7)
        pwm_id = MP_OBJ_SMALL_INT_VALUE(args[0]);
    // invalid argument
    else
        mp_raise_ValueError(MP_ERROR_TEXT("Type mismatch: not a Pin object or valid MxPWMx pwm identifier"));

    // create (select) pwm object
    machine_pwm_obj_t* self = &machine_pwm_obj[pwm_id];
    // flag pwm object as in use
    self->in_use = true;

    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);
    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);

