mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/pwm.c
    return machine_pwm_init_helper(self, n_args - 1, args + 1, &kw_args, pin);
}

//*****************************************************************************
//
//! \method init([pin, active, invert, freq, duty, db_falling, db_rising, mode, irq, irq_mode])
//! Constructor of PWM object
//!
//! \param pin specifies the output pin
//! \param active specifies the state of the output pin
//! \param invert inverts the state of the output pin
//! \param freq specifies the frequency of the PWM signal
//! \param duty specifies the duty cycle percentage of the PWM signal
//! \param db_falling specifies the deadband delay in clock ticks on a falling edge
//! \param db_rising specifies the deadband delay in clock ticks on a rising edge
//! \param mode specifies the mode of the PWM object. It is the logical OR of the 
//! following:
//! - \b MODE_DOWN or \b MODE_UP_DOWN to specify the counting
//!   mode
//! - \b MODE_SYNC or \b MODE_NO_SYNC to specify the counter
//!   load and comparator update synchronization mode
//! - \b MODE_DBG_RUN or \b MODE_DBG_STOP to specify the debug
//!   behavior
//! - \b MODE_GEN_NO_SYNC, \b MODE_GEN_SYNC_LOCAL, or
//!   \b MODE_GEN_SYNC_GLOBAL to specify the update synchronization
//!   mode for generator counting mode changes
//! - \b MODE_DB_NO_SYNC, \b MODE_DB_SYNC_LOCAL, or
//!   \b MODE_DB_SYNC_GLOBAL to specify the deadband parameter
//!   synchronization mode
//! \param irq is the interrupt handler to attach. This function receives the 
//! status of the interrupt register via its first argument of type \b int
//! \param irq_mode specifies interrupts and triggers to act upon.
//! The \e irq_mode logical OR of the following:
//! \b IRQ_INT_CNT_ZERO, \b IRQ_INT_CNT_LOAD, \b IRQ_INT_CNT_AU, \b IRQ_INT_CNT_AD,
//! \b IRQ_INT_CNT_BU, \b IRQ_INT_CNT_BD, \b IRQ_TR_CNT_ZERO, \b IRQ_TR_CNT_LOAD,
//! \b IRQ_TR_CNT_AU, \b IRQ_TR_CNT_AD, \b IRQ_TR_CNT_BU, or \b IRQ_TR_CNT_BD
//!
//! \return PWM object
//
//*****************************************************************************
static mp_obj_t machine_pwm_init(size_t n_args, const mp_obj_t* args, mp_map_t* kw_args)
{
    return machine_pwm_init_helper(args[0], n_args - 1, args + 1, kw_args, NULL);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(machine_pwm_init_obj, 1, machine_pwm_init);

//*****************************************************************************
//
//! \method deinit()
//! Deinitializes the PWM object
//!
//! \return None
//
//*****************************************************************************
static mp_obj_t machine_pwm_deinit(mp_obj_t self)
{
    return machine_pwm_deinit_helper(self);
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_pwm_deinit_obj, machine_pwm_deinit);

//*****************************************************************************
//
//! \method active([val])
//! Sets/gets the output of PWM object
//!
//! \param val is the desired output state
//!
//! \return Output state
//
//*****************************************************************************
static mp_obj_t machine_pwm_active(size_t n_args, const mp_obj_t* args)
{
    return machine_pwm_active_helper(args[0], n_args - 1, args + 1);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_pwm_active_obj, 1, 2, machine_pwm_active);

//*****************************************************************************
//
//! \method invert([val])
//! Sets/gets inversion of the output of PWM object
//!
//! \param val is the desired output inversion state
//!
//! \return Inversion state
//
//*****************************************************************************
static mp_obj_t machine_pwm_invert(size_t n_args, const mp_obj_t* args)
{
    return machine_pwm_invert_helper(args[0], n_args - 1, args + 1);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_pwm_invert_obj, 1, 2, machine_pwm_invert);

//*****************************************************************************
//
//! \method clock_divider([val])
//! Sets/gets global clock divider
//!
//! \param val is one of \b CLK_DIV_1, \b CLK_DIV_2, \b CLK_DIV_4,
//! \b CLK_DIV_8, \b CLK_DIV_16, \b CLK_DIV_32, \b CLK_DIV_64
//!
//! \return Clock divider, one of \b CLK_DIV_1, \b CLK_DIV_2, \b CLK_DIV_4,
//! \b CLK_DIV_8, \b CLK_DIV_16, \b CLK_DIV_32, \b CLK_DIV_64
//
//*****************************************************************************
static mp_obj_t machine_pwm_clock_divider(size_t n_args, const mp_obj_t* args)
{
    return machine_pwm_clock_divider_helper(args[0], n_args - 1, args + 1);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_pwm_clock_divider_obj, 1, 2, machine_pwm_clock_divider);

//*****************************************************************************
//
//! \method freq([val])
//! Sets/gets the frequency of PWM object
//!
//! \param val is the desired frequency
//!
//! \return Frequency
//
//*****************************************************************************
static mp_obj_t machine_pwm_freq(size_t n_args, const mp_obj_t* args)
{
    return machine_pwm_freq_helper(args[0], n_args - 1, args + 1);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_pwm_freq_obj, 1, 2, machine_pwm_freq);

//*****************************************************************************
//
//! \method duty([val])
//! Sets/gets the duty cycle of PWM object
//!
//! \param val is the desired duty cycle percentage
//!
//! \return Duty cycle (percentage)
//
//*****************************************************************************
static mp_obj_t machine_pwm_duty(size_t n_args, const mp_obj_t* args)
{
    return machine_pwm_duty_helper(args[0], n_args - 1, args + 1);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_pwm_duty_obj, 1, 2, machine_pwm_duty);

//*****************************************************************************
//
//! \method sync([pwm0, pwm1])
//! Syncs the timing of the provided PWM objects
//!
//! \param pwmX are the PWM objects to be synced
//!
//! \return None
//
//*****************************************************************************
static mp_obj_t machine_pwm_sync(size_t n_args, const mp_obj_t* args)
{
    return machine_pwm_sync_helper(args[0], n_args - 1, args + 1);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_pwm_sync_obj, 1, MICROPY_HW_MAX_PWM, machine_pwm_sync);

//*****************************************************************************
//
//! \method db([db_falling, db_rising])
//! Sets/gets the deadband delays of PWM object
//!
//! \param db_falling specifies the deadband delay in clock ticks on a falling edge
//! \param db_rising specifies the deadband delay in clock ticks on a rising edge
//!
//! \note Deadband delays are shared within generators, i.e. 
//! \b PWM_M0PWM0 and \b PWM_M0PWM1 share the same deadband delay, as do 
//! \b PWM_M0PWM2 and \b PWM_M0PWM3, etc.
//!
//! \return Tuple(db_falling, db_rising)
//
//*****************************************************************************
static mp_obj_t machine_pwm_db(size_t n_args, const mp_obj_t* args, mp_map_t* kw_args)
{
    return machine_pwm_db_helper(args[0], n_args - 1, args + 1, kw_args);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(machine_pwm_db_obj, 1, machine_pwm_db);

//*****************************************************************************
//
//! \method irq([irq, irq_mode])
//! Sets/gets the interrupt handler for PWM object
//!
//! \param self is a pointer to the PWM object
//! \param irq is the interrupt handler to attach. This function receives the 
//! status of the interrupt register via its first argument of type \b int
//! \param irq_mode specifies interrupts and triggers to act upon.
//! The \e irq_mode logical OR of the following:
//! \b IRQ_INT_CNT_ZERO, \b IRQ_INT_CNT_LOAD, \b IRQ_INT_CNT_AU, \b IRQ_INT_CNT_AD,
//! \b IRQ_INT_CNT_BU, \b IRQ_INT_CNT_BD, \b IRQ_TR_CNT_ZERO, \b IRQ_TR_CNT_LOAD,
//! \b IRQ_TR_CNT_AU, \b IRQ_TR_CNT_AD, \b IRQ_TR_CNT_BU, or \b IRQ_TR_CNT_BD
//!
//! \return Tuple(irq, irq_mode)
//
//*****************************************************************************
static mp_obj_t machine_pwm_irq(size_t n_args, const mp_obj_t* args)
{
    return machine_pwm_irq_helper(args[0], n_args - 1, args + 1);
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_pwm_irq_obj, 1, 3, machine_pwm_irq);


void pwm_init0(void)
{
    mp_obj_list_init(&MP_STATE_PORT(mp_pwm_obj_list), 0);
    // setup objects frequencies for correct initialization later
    for (uint8_t i = 0; i < MICROPY_HW_MAX_PWM; i++)
    {
        machine_pwm_obj_val_init(&machine_pwm_obj[i]);
        machine_pwm_obj[i].base.type = &machine_pwm_type;
        machine_pwm_obj[i].id =         i;
        machine_pwm_obj[i].twin_id =    (i % 2 ? i - 1: i + 1);
        machine_pwm_obj[i].mod_id =     !(i < PWM_M1PWM0);
        machine_pwm_obj[i].gen_id =     ((i % PWM_M1PWM0) - (i % 2)) / 2;
    }
}

