mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/pwm.c
static void machine_pwm_print(const mp_print_t* print, mp_obj_t self_in, mp_print_kind_t kind)
{
    machine_pwm_obj_t* self = MP_OBJ_TO_PTR(self_in);
    mp_printf(print, "PWM(Pin(%s), id = %u, mode = %u, active = %u, invert = %u, freq = %lu, duty = %u, irq = %s, irq_mode = %u, db_falling = %u, db_rising = %u)",
               (self->pin ? qstr_str(self->pin->name): "None"), self->id, self->mode, self->active, self->invert, self->freq, self->duty, (self->irq == mp_const_none ? "None" : self->irq), self->irq_mode, self->db_falling, self->db_rising);
}

static const mp_rom_map_elem_t machine_pwm_locals_dict_table[] = 
{
    // class methods
    {MP_ROM_QSTR(MP_QSTR_init),             MP_ROM_PTR(&machine_pwm_init_obj)},
    {MP_ROM_QSTR(MP_QSTR_deinit),           MP_ROM_PTR(&machine_pwm_deinit_obj)},
    {MP_ROM_QSTR(MP_QSTR_active),           MP_ROM_PTR(&machine_pwm_active_obj)},
    {MP_ROM_QSTR(MP_QSTR_invert),           MP_ROM_PTR(&machine_pwm_invert_obj)},
    {MP_ROM_QSTR(MP_QSTR_clock_divider),    MP_ROM_PTR(&machine_pwm_clock_divider_obj)},
    {MP_ROM_QSTR(MP_QSTR_freq),             MP_ROM_PTR(&machine_pwm_freq_obj)},
    {MP_ROM_QSTR(MP_QSTR_duty),             MP_ROM_PTR(&machine_pwm_duty_obj)},
    {MP_ROM_QSTR(MP_QSTR_sync),             MP_ROM_PTR(&machine_pwm_sync_obj)},
    {MP_ROM_QSTR(MP_QSTR_db),               MP_ROM_PTR(&machine_pwm_db_obj)},
    {MP_ROM_QSTR(MP_QSTR_irq),              MP_ROM_PTR(&machine_pwm_irq_obj)},

    // class constants
    // pwm identifier
    {MP_ROM_QSTR(MP_QSTR_M0PWM0),           MP_ROM_INT(PWM_M0PWM0)},
    {MP_ROM_QSTR(MP_QSTR_M0PWM1),           MP_ROM_INT(PWM_M0PWM1)},
    {MP_ROM_QSTR(MP_QSTR_M0PWM2),           MP_ROM_INT(PWM_M0PWM2)},
    {MP_ROM_QSTR(MP_QSTR_M0PWM3),           MP_ROM_INT(PWM_M0PWM3)},
    {MP_ROM_QSTR(MP_QSTR_M0PWM4),           MP_ROM_INT(PWM_M0PWM4)},
    {MP_ROM_QSTR(MP_QSTR_M0PWM5),           MP_ROM_INT(PWM_M0PWM5)},
    {MP_ROM_QSTR(MP_QSTR_M0PWM6),           MP_ROM_INT(PWM_M0PWM6)},
    {MP_ROM_QSTR(MP_QSTR_M0PWM7),           MP_ROM_INT(PWM_M0PWM7)},
    {MP_ROM_QSTR(MP_QSTR_M1PWM0),           MP_ROM_INT(PWM_M1PWM0)},
    {MP_ROM_QSTR(MP_QSTR_M1PWM1),           MP_ROM_INT(PWM_M1PWM1)},
    {MP_ROM_QSTR(MP_QSTR_M1PWM2),           MP_ROM_INT(PWM_M1PWM2)},
    {MP_ROM_QSTR(MP_QSTR_M1PWM3),           MP_ROM_INT(PWM_M1PWM3)},
    {MP_ROM_QSTR(MP_QSTR_M1PWM4),           MP_ROM_INT(PWM_M1PWM4)},
    {MP_ROM_QSTR(MP_QSTR_M1PWM5),           MP_ROM_INT(PWM_M1PWM5)},
    {MP_ROM_QSTR(MP_QSTR_M1PWM6),           MP_ROM_INT(PWM_M1PWM6)},
    {MP_ROM_QSTR(MP_QSTR_M1PWM7),           MP_ROM_INT(PWM_M1PWM7)},

    // pwm mode options
    {MP_ROM_QSTR(MP_QSTR_MODE_COUNT_DOWN),      MP_ROM_INT(PWM_GEN_MODE_DOWN)},
    {MP_ROM_QSTR(MP_QSTR_MODE_COUNT_UP_DOWN),   MP_ROM_INT(PWM_GEN_MODE_UP_DOWN)},
    {MP_ROM_QSTR(MP_QSTR_MODE_COUNT_UP_DOWN),   MP_ROM_INT(PWM_GEN_MODE_UP_DOWN)},
    {MP_ROM_QSTR(MP_QSTR_MODE_SYNC),            MP_ROM_INT(PWM_GEN_MODE_SYNC)},
    {MP_ROM_QSTR(MP_QSTR_MODE_NO_SYNC),         MP_ROM_INT(PWM_GEN_MODE_NO_SYNC)},
    {MP_ROM_QSTR(MP_QSTR_MODE_DBG_RUN),         MP_ROM_INT(PWM_GEN_MODE_DBG_RUN)},
    {MP_ROM_QSTR(MP_QSTR_MODE_DBG_STOP),        MP_ROM_INT(PWM_GEN_MODE_DBG_STOP)},
    {MP_ROM_QSTR(MP_QSTR_MODE_DB_NO_SYNC),      MP_ROM_INT(PWM_GEN_MODE_DB_NO_SYNC)},
    {MP_ROM_QSTR(MP_QSTR_MODE_DB_SYNC_LOCAL),   MP_ROM_INT(PWM_GEN_MODE_DB_SYNC_LOCAL)},
    {MP_ROM_QSTR(MP_QSTR_MODE_DB_SYNC_GLOBAL),  MP_ROM_INT(PWM_GEN_MODE_DB_SYNC_GLOBAL)},
    {MP_ROM_QSTR(MP_QSTR_MODE_GEN_NO_SYNC),     MP_ROM_INT(PWM_GEN_MODE_GEN_NO_SYNC)},
    {MP_ROM_QSTR(MP_QSTR_MODE_GEN_SYNC_LOCAL),  MP_ROM_INT(PWM_GEN_MODE_GEN_SYNC_LOCAL)},
    {MP_ROM_QSTR(MP_QSTR_MODE_GEN_SYNC_GLOBAL), MP_ROM_INT(PWM_GEN_MODE_GEN_SYNC_GLOBAL)},

    // pwm clock divider
    {MP_ROM_QSTR(MP_QSTR_CLK_DIV_1),            MP_ROM_INT(PWM_SYSCLK_DIV_1)},
    {MP_ROM_QSTR(MP_QSTR_CLK_DIV_2),            MP_ROM_INT(PWM_SYSCLK_DIV_2)},
    {MP_ROM_QSTR(MP_QSTR_CLK_DIV_4),            MP_ROM_INT(PWM_SYSCLK_DIV_4)},
    {MP_ROM_QSTR(MP_QSTR_CLK_DIV_8),            MP_ROM_INT(PWM_SYSCLK_DIV_8)},
    {MP_ROM_QSTR(MP_QSTR_CLK_DIV_16),           MP_ROM_INT(PWM_SYSCLK_DIV_16)},
    {MP_ROM_QSTR(MP_QSTR_CLK_DIV_32),           MP_ROM_INT(PWM_SYSCLK_DIV_32)},
    {MP_ROM_QSTR(MP_QSTR_CLK_DIV_64),           MP_ROM_INT(PWM_SYSCLK_DIV_64)},

    // pwm irq options
    {MP_ROM_QSTR(MP_QSTR_IRQ_INT_CNT_ZERO),     MP_ROM_INT(PWM_INT_CNT_ZERO)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_INT_CNT_LOAD),     MP_ROM_INT(PWM_INT_CNT_LOAD)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_INT_CNT_AU),       MP_ROM_INT(PWM_INT_CNT_AU)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_INT_CNT_AD),       MP_ROM_INT(PWM_INT_CNT_AD)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_INT_CNT_BU),       MP_ROM_INT(PWM_INT_CNT_BU)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_INT_CNT_BD),       MP_ROM_INT(PWM_INT_CNT_BD)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_TR_CNT_ZERO),      MP_ROM_INT(PWM_TR_CNT_ZERO)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_TR_CNT_LOAD),      MP_ROM_INT(PWM_TR_CNT_LOAD)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_TR_CNT_AU),        MP_ROM_INT(PWM_TR_CNT_AU)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_TR_CNT_AD),        MP_ROM_INT(PWM_TR_CNT_AD)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_TR_CNT_BU),        MP_ROM_INT(PWM_TR_CNT_BU)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_TR_CNT_BD),        MP_ROM_INT(PWM_TR_CNT_BD)},
};
static MP_DEFINE_CONST_DICT(machine_pwm_locals_dict, machine_pwm_locals_dict_table);

const mp_obj_type_t machine_pwm_type = 
{
    { &mp_type_type },
    .name = MP_QSTR_PWM,
    .print = machine_pwm_print,
    .make_new = mp_machine_pwm_make_new,
    .locals_dict = (mp_obj_dict_t*) &machine_pwm_locals_dict,
};
